# Pandas (Part 2) - Cleaning Data

Recall that during our last class period, we learned how to import data into Python using Pandas. We also learned how to specify column types, select columns, and select rows with logic. Today, we'll be learning functions to clean the data such as dropping and keeping columns, dealing with duplicates and missing data, and converting column data types.

To get started, let's import pandas and the common options we talked about last time.

In [1]:
import pandas as pd

pd.options.display.float_format = '{:,.2f}'.format # Display option to include 2 decimal places on all floats
pd.set_option('display.max_columns', None) # Display option to show all columns
pd.set_option('display.max_rows', None) # Display option to show all rows

#### Dropping and Keeping Columns

To illustrate dropping and keeping columns, let's use this simple `df` DataFrame:

In [2]:
df = pd.DataFrame({'ticker':['AAPL','MSFT','AMZN','F','T'], 'year': [2020,2020,2020,2020,2019], 'eps':[1.5,3.2,1.2,-1.1,1.6],'revenue':[1000,3000,5000,2000,1500],'cogs':[500,1000,4000,200,400]})
df.head()

  ticker  year   eps  revenue  cogs
0   AAPL  2020  1.50     1000   500
1   MSFT  2020  3.20     3000  1000
2   AMZN  2020  1.20     5000  4000
3      F  2020 -1.10     2000   200
4      T  2019  1.60     1500   400

##### Drop Columns

We can drop columns from a DataFrame using the code:

    data = data.drop(columns=['column_name1','column_name2',etc.])

For example, let's drop the `eps` and `cogs` columns from the `df` DataFrame.

In [3]:
df = df.drop(columns=['eps','cogs'])
df.head()

  ticker  year  revenue
0   AAPL  2020     1000
1   MSFT  2020     3000
2   AMZN  2020     5000
3      F  2020     2000
4      T  2019     1500

##### Keep Columns

Alternatively, we can keep only specific columns by passing the columns we want to keep within double brackets. For example, if we have a DataFrame in which we'd like to keep only the columns called `col1` and `col2`, we would use the code:

    new_data = data[['col1','col2']]
    
For example, let's keep only the `ticker` and `revenue` columns in `df`.

In [4]:
df = df[['ticker','revenue']]
df.head()

  ticker  revenue
0   AAPL     1000
1   MSFT     3000
2   AMZN     5000
3      F     2000
4      T     1500

#### Exercise 1

First, run the cell below to import the **violations.csv** file into the `viol` DataFrame. This is the data set we were working with during our last class period in the exercises.

In [5]:
viol = pd.read_csv('violations.csv',parse_dates=['date'],dtype={'zip':str,'penalty':str,'year':str})
viol.head()

,ticker,company,penalty,year,date,offense,description,civil/criminal,zip,ownership structure,industry
0,NaN,CATHOLIC HEALTHCARE WEST SOUTHERN CALIFORNIA (...,"$45,000",2001,2001-10-22,labor relations violation,back pay award in unfair labor practices case,civil,90250,non-profit,healthcare services
1,WM,"Waste Management of Missouri, Inc. d/b/a Waste...","$23,000",2001,2001-03-02,labor relations violation,back pay award in unfair labor practices case,civil,65402,publicly traded,waste management
2,T,180 Connect Inc,"$96,475",2007,2007-05-07,wage and hour violation,NaN,civil,11735,publicly traded,telecommunications
3,T,"180 Connect, Inc.","$47,588",2004,2004-09-25,wage and hour violation,NaN,civil,35124-1232,publicly traded,telecommunications
4,NaN,1st Financial Bank USA,"$10,140,000",2010,2010-01-29,banking violation,The Federal Deposit Insurance Corporation anno...,civil,NaN,privately held,banking

1. Drop the `company` column from `viol`. Print the first five rows of `viol` to ensure it was properly dropped.

In [6]:
# 1

2. Create a new DataFrame called `new_viol` that includes only the `ticker`, `date`, and `penalty` columns from `viol`. Print the first five rows of `new_viol`.

In [7]:
# 2

#### Duplicate Rows

To illustrate duplicate rows, let's use this simple `df` DataFrame:

In [8]:
df = pd.DataFrame({'ticker':['F','F','T','T','TSLA'], 'date':['2022-12-30','2022-12-31','2023-06-30','2023-06-30','2019-03-31'], 'revenue':[15000,15000,10000,10000,15000]}) 
df.head()

  ticker        date  revenue
0      F  2022-12-30    15000
1      F  2022-12-31    15000
2      T  2023-06-30    10000
3      T  2023-06-30    10000
4   TSLA  2019-03-31    15000

##### View Duplicate Rows

If our data has duplicate rows, we may want to delete them. To check if we have duplicate rows, we can use the `duplicated()` function. (Use the `keep=False` option to view all duplicate rows, not just the first duplicate row for each duplicate group).

In [9]:
dup_rows = df[df.duplicated(keep=False)]
dup_rows.head()

  ticker        date  revenue
2      T  2023-06-30    10000
3      T  2023-06-30    10000

##### View Duplicate Rows Based on Specific Columns

If we want to view duplicate rows based only on certain columns, we can add these column names to the `duplicated()` function.

In [10]:
dup_rows = df[df.duplicated(['ticker','revenue'], keep=False)]
dup_rows.head()

  ticker        date  revenue
0      F  2022-12-30    15000
1      F  2022-12-31    15000
2      T  2023-06-30    10000
3      T  2023-06-30    10000

##### Drop Duplicates

We can drop duplicates across all variables in our DataFrame using the `drop_duplicates()` function.

In [11]:
df = df.drop_duplicates()
df.head()

  ticker        date  revenue
0      F  2022-12-30    15000
1      F  2022-12-31    15000
2      T  2023-06-30    10000
4   TSLA  2019-03-31    15000

##### Drop Duplicates Based on Specific Columns

We can drop duplicates based on specific columns (e.g., `ticker` and `revenue`) by adding these to the `drop_duplicates()` function.

In [12]:
df = df.drop_duplicates(['ticker','revenue'])
df.head()

  ticker        date  revenue
0      F  2022-12-30    15000
2      T  2023-06-30    10000
4   TSLA  2019-03-31    15000

#### Exercise 2

Run the cell below to re-import the **violations.csv** file into the `viol` DataFrame.

In [13]:
viol = pd.read_csv('violations.csv',parse_dates=['date'],dtype={'zip':str,'penalty':str,'year':str})

1. Create a new DataFrame containing all duplicate rows in the `viol` DataFrame. How many rows are duplicates in our data?

In [14]:
# 1

2. Drop duplicate rows (i.e., keep the first duplicate row for each set of duplicates but drop all other duplicates) from the `viol` DataFrame where a duplicate row is based only on the `ticker` and `date` columns.

In [15]:
# 2

#### Missing Data

For missing data, we can:

1. Keep the missing data
2. Drop rows with missing data, or 
3. Fill in the missing values

To illustrate with a simple example, let's import this `df` DataFrame which contains a few missing values:

In [16]:
import numpy as np
df = pd.DataFrame({'ticker':['AAPL','MSFT','AMZN','F','T'], 'date': ['12/31/2020','9/30/2020','12/31/2020','6/30/2020',np.nan], 'eps':[1.5,3.2,np.nan,-1.1,1.6],'revenue':[np.nan,3000,5000,2000,1500]})
df.head()

  ticker        date   eps  revenue
0   AAPL  12/31/2020  1.50      NaN
1   MSFT   9/30/2020  3.20 3,000.00
2   AMZN  12/31/2020   NaN 5,000.00
3      F   6/30/2020 -1.10 2,000.00
4      T         NaN  1.60 1,500.00

##### View Rows with Missing Values

To view rows with missing values in specific columns, we can use the `isnull()` function:

In [17]:
df1 = df[df['eps'].isnull()]
df1.head()

  ticker        date  eps  revenue
2   AMZN  12/31/2020  NaN 5,000.00

##### Drop Missing Values

To drop missing values across all variables we can use the `dropna()` function:

In [18]:
df1 = df.dropna()
df1.head()

  ticker       date   eps  revenue
1   MSFT  9/30/2020  3.20 3,000.00
3      F  6/30/2020 -1.10 2,000.00

To drop rows with missing values only in specific columns, we can add the `subset` option within the `dropna()` function.

In [19]:
df1 = df.dropna(subset=['eps','revenue'])
df1.head()

  ticker       date   eps  revenue
1   MSFT  9/30/2020  3.20 3,000.00
3      F  6/30/2020 -1.10 2,000.00
4      T        NaN  1.60 1,500.00

##### Fill Missing Values

We can fill missing values using the `fillna()` function. We might use this approach if we know that missing values represent zeros.

In [20]:
df['revenue_fixed'] = df['revenue'].fillna(0)
df.head()

  ticker        date   eps  revenue  revenue_fixed
0   AAPL  12/31/2020  1.50      NaN           0.00
1   MSFT   9/30/2020  3.20 3,000.00       3,000.00
2   AMZN  12/31/2020   NaN 5,000.00       5,000.00
3      F   6/30/2020 -1.10 2,000.00       2,000.00
4      T         NaN  1.60 1,500.00       1,500.00

#### Exercise 3

Run the cell below to re-import the **violations.csv** file into the `viol` DataFrame.

In [21]:
viol = pd.read_csv('violations.csv',parse_dates=['date'],dtype={'zip':str,'penalty':str,'year':str})

1. Fill in the `zip` column in the `viol` DataFrame with a blank string (i.e., `''`) if the value is missing.

In [22]:
# 1

2. Drop all observations in the `viol` DataFrame in which the `ticker` is missing.

In [23]:
# 2

#### Converting Column Data Types

Sometimes Python gets the column types wrong and we cannot fix them while importing.

For example, assume you have a data set with a `zipcode` column with values such as:

    92845
    98143-1002
    
If we were to try to import this data into a Pandas DataFrame and specify that the variable type for `zipcode` is an integer, we would receive an error due to the `-` in some of the `zipcode` values.

In instances such as these, we need to convert columns into their correct data types after importing the data.

To illustrate, let's create this simple `df` DataFrame:

In [24]:
df = pd.DataFrame({'ticker':['AAPL','MSFT','AMZN','F','T'], 'year': ['2020','2010','2019','2019','2015'], 'zip':['92845','98143-1002','31904-5432','01234','84602']})
df.head()

  ticker  year         zip
0   AAPL  2020       92845
1   MSFT  2010  98143-1002
2   AMZN  2019  31904-5432
3      F  2019       01234
4      T  2015       84602

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ticker  5 non-null      object
 1   year    5 non-null      object
 2   zip     5 non-null      object
dtypes: object(3)
memory usage: 248.0+ bytes

##### Convert Columns Using astype()

The easiest way to convert a column is to use the `astype()` function. We can use `astype(int)` to convert to integer, `astype(float)` to convert to float, and `astype(str)` to convert to string.

For example, to convert the `year` column to an integer, we would use the following code:

In [26]:
df['year'] = df['year'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ticker  5 non-null      object
 1   year    5 non-null      int32
 2   zip     5 non-null      object
dtypes: int32(1), object(2)
memory usage: 228.0+ bytes

One problem we will often run into is that Python cannot convert numerical data with special characters such as commas, dollar signs, and dashes into numerical data types (e.g., int and float).

For example, in the `df` DataFrame, the `zip` column cannot be converted into an integer because some of the observations contain a dash with four additional numbers.

To illustrate, let's test what happens when we attempt to use `astype()` to convert the `zip` column into an integer.

In [27]:
df['zip_int'] = df['zip'].astype(int)
df.head()

ValueError: invalid literal for int() with base 10: '98143-1002'

Notice the error: "invalid literal for int() with base 10".

##### Convert Columns Using to_numeric()

One possible solution is to use the `to_numeric()` function which allows you to use an option called `errors = 'coerce'` to simply report missing values for rows that return errors when converting.

Let's illustrate by trying to convert `zip` to numeric:

In [28]:
df['zip_fixed'] = pd.to_numeric(df['zip'], errors='coerce')
df.head()

  ticker  year         zip  zip_fixed
0   AAPL  2020       92845  92,845.00
1   MSFT  2010  98143-1002        NaN
2   AMZN  2019  31904-5432        NaN
3      F  2019       01234   1,234.00
4      T  2015       84602  84,602.00

Using the `to_numeric` function might be useful if you have data that contains errors only in certain rows such as `'-'` instead of a number.  It would be okay if Python converted a `'-'` to a blank value. However, in our case, the `zip` column truly contains a number and we don't want Python to assign a null value for each observation.

##### Convert Columns by Applying Functions

To properly convert this `zip` column, we can create a function that takes a string as input and removes the dash and any numbers that follow it. We can then apply the function to the `zip` column in our DataFrame. 

To illustrate, let's just start with a single variable called `zipvar`:

In [29]:
zipvar = '92845-1234'

Let's write some simple code to extract just the numbers before the `-` and then convert the `zipvar` to an integer:

In [30]:
zipvar = zipvar.split('-')[0]
zipvar = int(zipvar)
print(zipvar)
print(type(zipvar))

92845
<class 'int'>

Now, let's create a function that takes the `zipvar` as an input, and outputs the fixed float version of `zipvar`:

In [31]:
def convert_zip(zipvar):
    zipvar = zipvar.split('-')[0]
    zipvar = int(zipvar)
    return zipvar

zipvar = '92845-1234'
zipvar = convert_zip(zipvar)
print(zipvar)
print(type(zipvar))

92845
<class 'int'>

Finally, we can apply this function to the `zip` column in our `df` DataFrame to properly convert the `zip` column to an integer.

In [32]:
df['zip_fixed2'] = df['zip'].apply(convert_zip)
print(df.info())
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ticker      5 non-null      object
 1   year        5 non-null      int32
 2   zip         5 non-null      object
 3   zip_fixed   3 non-null      float64
 4   zip_fixed2  5 non-null      int64
dtypes: float64(1), int32(1), int64(1), object(2)
memory usage: 308.0+ bytes
None

  ticker  year         zip  zip_fixed  zip_fixed2
0   AAPL  2020       92845  92,845.00       92845
1   MSFT  2010  98143-1002        NaN       98143
2   AMZN  2019  31904-5432        NaN       31904
3      F  2019       01234   1,234.00        1234
4      T  2015       84602  84,602.00       84602

#### Exercise 4

Run the cell below to re-import the **violations.csv** file into the `viol` DataFrame.

In [ ]:
viol = pd.read_csv('violations.csv',parse_dates=['date'],dtype={'zip':str,'penalty':str,'year':str})

1. Convert the `year` column in the `viol` DataFrame to an integer using the `astype()` function.

In [ ]:
# 1

2. Try to convert the `penalty` column in the `viol` DataFrame to a float using the `astype()` function. What is the error you receive?

In [ ]:
# 2

3. Create and apply a function to the `penalty` column to convert the `penalty` column to a float.

In [ ]:
# 3

#### Converting Date Columns

To illustrate converting date columns, let's import this simple `df` DataFrame:

In [ ]:
df = pd.DataFrame({'ticker':['AAPL','MSFT','AMZN','F','T'], 'date1': ['20150101','20190523','20200115','20140210','20181230'], 'month':[12,6,9,12,12], 'day':[31,30,30,31,31], 'year':[2015,2019,2020,2014,2018]})
df.info()
df.head()

We learned last time that we can convert our date columns to datetime objects in Python using the `parse_dates` option in the `read_csv` command.

Alternatively, Pandas has a built in function to convert a variable to datetime called `to_datetime()`. For example, to convert the `date` column in the `df` DataFrame (which is stored as a string) to a datetime variable, we would use the following code:

In [ ]:
df['date1'] = pd.to_datetime(df['date1'])
df.info()
df.head()

We can also use `pd.to_datetime()` to create a date using `month`, `day`, and `year` columns. The column names must be exactly `month`, `day` and `year` but the ordering of the columns in the DataFrame does not matter.

In [ ]:
df['date2'] = pd.to_datetime(df[['month','day','year']])
df.head()

#### Create Month, Day, and Year Columns from an Existing DateTime Column

We can also create `month`, `day`, and `year` columns based on existing date columns. Let's illustrate using the following simple DataFrame:

In [ ]:
df = pd.DataFrame({'ticker':['AAPL','MSFT','AMZN','F','T'], 'date': ['20150101','20190523','20200115','20140210','20181230']})
df['date'] = pd.to_datetime(df['date'])
df.head()

To create new columns with the month, day, and year of the `date` column, we can use the `dt.month`, `dt.day`, and `dt.year` functions as follows:

In [ ]:
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df['year'] = df['date'].dt.year
df.head()

#### Creating Columns Based on Existing Data

To illustrate some additional examples of creating columns, let's import this simple `df` DataFrame:

In [ ]:
df = pd.DataFrame({'ticker':['aapl','~msft~','amzn|amazon','f|ford','t'], 'date': ['12/31/2020','9/30/2020','12/31/2020','6/30/2020','12/31/2019'], 'stock_price':[75.5,62.2,103.2,52.1,85.6],'shares_outstanding':[1000,3000,5000,2000,1500],'industry':['Computers','Computers','E-Commerce','Automobiles','Cell Phones']})
df['date'] = pd.to_datetime(df['date'])
df.head()

##### Create Numeric Columns

We can use existing columns to create new columns in our data. For example, if we want to multiply each observation in the `shares_outstanding` column in the `df` DataFrame by 1000 and create a new column with the result, we would use the code:

In [ ]:
df['shares_outstanding_updated'] = df['shares_outstanding']*1000
df.head()

We can also use multiple exisiting columns in our calculations. For example, let's create a column called `market_cap` equal to `stock price` multiplied by `shares_outstanding_updated`.

In [ ]:
df['market_cap'] = df['stock_price'] * df['shares_outstanding_updated']
df.head()

##### Create String Columns

We can create new columns based on columns with strings using the `str` function. After calling the `str` function, we can perform any type of string function just as if we were referencing a single string variable.

For example, the following code creates a new column that cleans our `ticker` variable:

In [ ]:
df['ticker_fixed'] = df['ticker'].str.upper().str.replace('~','').str.split('|').str[0]
df.head()

##### Concatenate Data Across Multiple Columns

We can concatenate data across multiple columns as follows:

In [ ]:
df['ticker_industry'] = df['ticker']+'|'+df['industry']
df.head()

**NOTE:** We cannot use the f-string method to concatenate these columns. We have to use the concatenating method we learned in our Intro to Python (Part 1) class. 

Also, the above code will work only if both columns are strings. If not, we can use `.astype(str)` to convert the non-string columns into strings and then concatenate the columns without error. Here's an example in which the `revenue` column is numeric:

In [ ]:
df['ticker_revenue'] = df['ticker']+'|'+df['revenue'].astype(str)
df.head()

#### Exercise 5

You are provided a simple DataFrame called `df` that includes names, genders, heights, and marital statuses for four people.

In [ ]:
df = pd.DataFrame({'person':['Robby','Karen','Lydia','Greg'], 'gender':['M', 'F', 'F', 'M'], 'height':[5.6, 5.5, 5.3, 6.2], 'marital_status':['married','married','married','single']}) 
df.head()

1. Create a new column called `sentence` with the sentence "Robby is married." for each row, filling in the appropriate name and marital status.

In [ ]:
# 1

2. Create a new column that includes only the first letter of the `marital_status` column. Extra bonus points if you can get that letter to be upper case.

In [ ]:
# 2

3. Create a new column that multiplies `height` by 100.

In [ ]:
# 3